/*
Navicat MySQL Data Transfer

Source Server         : GoldenLee
Source Server Version : 50726
Source Host           : localhost:3306
Source Database       : blog

Target Server Type    : MYSQL
Target Server Version : 50726
File Encoding         : 65001

Date: 2019-09-08 12:46:09
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for article
-- ----------------------------
DROP TABLE IF EXISTS `article`;
CREATE TABLE `article` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '文章id',
  `article_title` varchar(60) NOT NULL COMMENT '文章标题',
  `article_desc` varchar(120) NOT NULL COMMENT '博客描述',
  `article_keyword` varchar(60) NOT NULL COMMENT '博客关键字',
  `article_content` text NOT NULL COMMENT '博客内容',
  `article_cate_id` int(10) NOT NULL COMMENT '博客分类id',
  `article_upload_time` int(11) NOT NULL COMMENT '博客上传时间',
  `article_author` varchar(30) NOT NULL COMMENT '博客作者',
  `article_visit_count` int(10) NOT NULL DEFAULT '0' COMMENT '文章访问量',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of article
-- ----------------------------
INSERT INTO `article` VALUES ('3', 'Autoload 自动载入', 'a', 'Autoload 自动载入', '&lt;p&gt;据海关统计，今年前8个月，我国货物贸易进出口总值20.13万亿元人民币，比去年同期（下同）增长3.6%。其中，出口10.95万亿元，增长6.1%；进口9.18万亿元，增长0.8%；贸易顺差1.77万亿元，扩大46%。&lt;/p&gt;&lt;p&gt;8月份，我国进出口总值2.72万亿元，增长0.1%。其中，出口1.48万亿元，增长2.6%；进口1.24万亿元，下降2.6%；贸易顺差2396亿元，扩大41.8%。&lt;/p&gt;&lt;p&gt;按美元计价，前8个月，我国进出口总值2.95万亿美元，下降2%。其中，出口1.6万亿美元，增长0.4%；进口1.35万亿美元，下降4.6%；贸易顺差2592.7亿美元，扩大37.1%。&lt;/p&gt;&lt;p&gt;8月份，我国进出口总值3947.6亿美元，下降3.2%。其中，出口2148亿美元，下降1%；进口1799.6亿美元，下降5.6%；贸易顺差348.4亿美元，扩大32.5%。&lt;/p&gt;&lt;p&gt;前8个月，我国外贸进出口主要呈现以下特点：&lt;/p&gt;&lt;p&gt;一、一般贸易增长且比重提升。前8个月，我国一般贸易进出口12.03万亿元，增长5.4%，占我外贸总值的59.8%，比去年同期提升1个百分点。其中，出口6.44万亿元，增长9.4%；进口5.59万亿元，增长1%；贸易顺差8494.9亿元，扩大1.4倍。同期，加工贸易进出口5.02万亿元，下降3.3%，占24.9%，下滑1.8个百分点。其中，出口3.18万亿元，下降1.6%；进口1.84万亿元，下降5.9%；贸易顺差1.34万亿元，扩大4.9%。&lt;/p&gt;&lt;p&gt;此外，我国以保税物流方式进出口2.31万亿元，增长9.9%，占我外贸总值的11.5%。其中，出口7679.7亿元，增长14%；进口1.55万亿元，增长8%。&lt;/p&gt;&lt;p&gt;二、对欧盟、东盟和日本等主要市场进出口增长，对“一带一路”沿线国家进出口增速高于整体。前8个月，欧盟为我国第一大贸易伙伴，中欧贸易总值3.15万亿元，增长9.7%，占我外贸总值的15.6%。其中，对欧盟出口1.9万亿元，增长11.8%；自欧盟进口1.25万亿元，增长6.7%；对欧贸易顺差6597.9亿元，扩大22.9%。东盟为我国第二大贸易伙伴，与东盟贸易总值为2.74万亿元，增长11.7%，占我外贸总值的13.6%。其中，对东盟出口1.53万亿元，增长15.7%；自东盟进口1.21万亿元，增长6.9%；对东盟贸易顺差3295亿元，扩大65.4%。&lt;/p&gt;&lt;p&gt;美国为我国第三大贸易伙伴，中美贸易总值为2.42万亿元，下降9%，占我外贸总值的12%。其中，对美国出口1.88万亿元，下降3.7%；自美国进口5450.1亿元，下降23.5%；对美贸易顺差1.33万亿元，扩大7.7%。日本为我国第四大贸易伙伴，中日贸易总值为1.39万亿元，增长0.7%，占我外贸总值的6.9%。其中，对日本出口6358.1亿元，增长4.7%；自日本进口7522.3亿元，下降2.4%；对日贸易逆差1164.2亿元，收窄28.8%。同期，我国对“一带一路”沿线国家合计进出口5.83万亿元，增长9.9%，高出全国整体增速6.3个百分点，占我外贸总值的29%，比重提升1.7个百分点。&lt;/p&gt;&lt;p&gt;三、民营企业进出口快速增长，所占比重提升。前8个月，民营企业进出口8.49万亿元，增长11.2%，占我外贸总值的42.2%，比去年同期提升2.9个百分点。其中，出口5.61万亿元，增长13.7%，占出口总值的51.2%；进口2.88万亿元，增长6.6%，占进口总值的31.3%。同期，外商投资企业进出口8.09万亿元，下降1.8%，占我外贸总值的40.2%。其中，出口4.27万亿元，增长0.2%；进口3.82万亿元，下降3.9%。&lt;/p&gt;&lt;p&gt;此外，国有企业进出口3.48万亿元，下降0.1%，占我外贸总值的17.3%。其中，出口1.06万亿元，下降5.4%；进口2.42万亿元，增长2.5%。&lt;/p&gt;&lt;p&gt;四、机电产品、劳动密集型产品出口均保持增长。前8个月，我国机电产品出口6.34万亿元，增长5.6%，占出口总值的57.9%。其中，电器及电子产品出口2.83万亿元，增长7%；机械设备1.87万亿元，增长3.3%。同期，服装出口6692.4亿元，增长1.2%；纺织品5410.1亿元，增长6.8%；家具2399.6亿元，增长8.1%；鞋类2155.1亿元，增长6.4%；塑料制品2113.1亿元，增长18.2%；玩具1293亿元，增长33.7%；箱包1206亿元，增长5.6%；上述7大类劳动密集型产品合计出口2.13万亿元，增长7.3%，占出口总值的19.4%。此外，钢材出口4497万吨，减少4.4%；汽车79万辆，增加4%。&lt;/p&gt;&lt;p&gt;五、原油、煤、天然气等商品进口量增加，铁矿砂、大豆进口量减少，大宗商品进口均价涨跌互现。前8个月，我国进口铁矿砂6.85亿吨，减少3.5%，进口均价为每吨644.3元，上涨43.3%；原油3.28亿吨，增加9.6%，进口均价为每吨3285.7元，下跌0.1%；煤2.2亿吨，增加8.1%，进口均价为每吨537.6元，下跌6.2%；天然气6304万吨，增加10.3%，进口均价为每吨2988.4元，上涨15.7%；大豆5632万吨，减少9.2%，进口均价为每吨2731.9元，下跌1.7%；初级形状的塑料2399万吨，增加11.1%，进口均价为每吨1万元，下跌11%；成品油2049万吨，减少6.3%，进口均价为每吨3790.4元，下跌0.6%；钢材764万吨，减少12.8%，进口均价为每吨8172.8元，上涨0.6%；未锻轧铜及铜材309万吨，减少10.8%，进口均价为每吨4.54万元，下跌3.5%。&lt;/p&gt;&lt;p&gt;此外，机电产品进口3.96万亿元，下降3.1%。其中，集成电路2719.4亿个，减少3.8%，价值1.31万亿元，下降0.8%；汽车70万辆，减少10.8%，价值2180.6亿元，下降4.6%。&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;', '1', '1567945971', '小黄鸡', '3');
INSERT INTO `article` VALUES ('4', 'a', 'a', 'linux', '&lt;p&gt;据海关统计，今年前8个月，我国货物贸易进出口总值20.13万亿元人民币，比去年同期（下同）增长3.6%。其中，出口10.95万亿元，增长6.1%；进口9.18万亿元，增长0.8%；贸易顺差1.77万亿元，扩大46%。&lt;/p&gt;&lt;p&gt;8月份，我国进出口总值2.72万亿元，增长0.1%。其中，出口1.48万亿元，增长2.6%；进口1.24万亿元，下降2.6%；贸易顺差2396亿元，扩大41.8%。&lt;/p&gt;&lt;p&gt;按美元计价，前8个月，我国进出口总值2.95万亿美元，下降2%。其中，出口1.6万亿美元，增长0.4%；进口1.35万亿美元，下降4.6%；贸易顺差2592.7亿美元，扩大37.1%。&lt;/p&gt;&lt;p&gt;8月份，我国进出口总值3947.6亿美元，下降3.2%。其中，出口2148亿美元，下降1%；进口1799.6亿美元，下降5.6%；贸易顺差348.4亿美元，扩大32.5%。&lt;/p&gt;&lt;p&gt;前8个月，我国外贸进出口主要呈现以下特点：&lt;/p&gt;&lt;p&gt;一、一般贸易增长且比重提升。前8个月，我国一般贸易进出口12.03万亿元，增长5.4%，占我外贸总值的59.8%，比去年同期提升1个百分点。其中，出口6.44万亿元，增长9.4%；进口5.59万亿元，增长1%；贸易顺差8494.9亿元，扩大1.4倍。同期，加工贸易进出口5.02万亿元，下降3.3%，占24.9%，下滑1.8个百分点。其中，出口3.18万亿元，下降1.6%；进口1.84万亿元，下降5.9%；贸易顺差1.34万亿元，扩大4.9%。&lt;/p&gt;&lt;p&gt;此外，我国以保税物流方式进出口2.31万亿元，增长9.9%，占我外贸总值的11.5%。其中，出口7679.7亿元，增长14%；进口1.55万亿元，增长8%。&lt;/p&gt;&lt;p&gt;二、对欧盟、东盟和日本等主要市场进出口增长，对“一带一路”沿线国家进出口增速高于整体。前8个月，欧盟为我国第一大贸易伙伴，中欧贸易总值3.15万亿元，增长9.7%，占我外贸总值的15.6%。其中，对欧盟出口1.9万亿元，增长11.8%；自欧盟进口1.25万亿元，增长6.7%；对欧贸易顺差6597.9亿元，扩大22.9%。东盟为我国第二大贸易伙伴，与东盟贸易总值为2.74万亿元，增长11.7%，占我外贸总值的13.6%。其中，对东盟出口1.53万亿元，增长15.7%；自东盟进口1.21万亿元，增长6.9%；对东盟贸易顺差3295亿元，扩大65.4%。&lt;/p&gt;&lt;p&gt;美国为我国第三大贸易伙伴，中美贸易总值为2.42万亿元，下降9%，占我外贸总值的12%。其中，对美国出口1.88万亿元，下降3.7%；自美国进口5450.1亿元，下降23.5%；对美贸易顺差1.33万亿元，扩大7.7%。日本为我国第四大贸易伙伴，中日贸易总值为1.39万亿元，增长0.7%，占我外贸总值的6.9%。其中，对日本出口6358.1亿元，增长4.7%；自日本进口7522.3亿元，下降2.4%；对日贸易逆差1164.2亿元，收窄28.8%。同期，我国对“一带一路”沿线国家合计进出口5.83万亿元，增长9.9%，高出全国整体增速6.3个百分点，占我外贸总值的29%，比重提升1.7个百分点。&lt;/p&gt;&lt;p&gt;三、民营企业进出口快速增长，所占比重提升。前8个月，民营企业进出口8.49万亿元，增长11.2%，占我外贸总值的42.2%，比去年同期提升2.9个百分点。其中，出口5.61万亿元，增长13.7%，占出口总值的51.2%；进口2.88万亿元，增长6.6%，占进口总值的31.3%。同期，外商投资企业进出口8.09万亿元，下降1.8%，占我外贸总值的40.2%。其中，出口4.27万亿元，增长0.2%；进口3.82万亿元，下降3.9%。&lt;/p&gt;&lt;p&gt;此外，国有企业进出口3.48万亿元，下降0.1%，占我外贸总值的17.3%。其中，出口1.06万亿元，下降5.4%；进口2.42万亿元，增长2.5%。&lt;/p&gt;&lt;p&gt;四、机电产品、劳动密集型产品出口均保持增长。前8个月，我国机电产品出口6.34万亿元，增长5.6%，占出口总值的57.9%。其中，电器及电子产品出口2.83万亿元，增长7%；机械设备1.87万亿元，增长3.3%。同期，服装出口6692.4亿元，增长1.2%；纺织品5410.1亿元，增长6.8%；家具2399.6亿元，增长8.1%；鞋类2155.1亿元，增长6.4%；塑料制品2113.1亿元，增长18.2%；玩具1293亿元，增长33.7%；箱包1206亿元，增长5.6%；上述7大类劳动密集型产品合计出口2.13万亿元，增长7.3%，占出口总值的19.4%。此外，钢材出口4497万吨，减少4.4%；汽车79万辆，增加4%。&lt;/p&gt;&lt;p&gt;五、原油、煤、天然气等商品进口量增加，铁矿砂、大豆进口量减少，大宗商品进口均价涨跌互现。前8个月，我国进口铁矿砂6.85亿吨，减少3.5%，进口均价为每吨644.3元，上涨43.3%；原油3.28亿吨，增加9.6%，进口均价为每吨3285.7元，下跌0.1%；煤2.2亿吨，增加8.1%，进口均价为每吨537.6元，下跌6.2%；天然气6304万吨，增加10.3%，进口均价为每吨2988.4元，上涨15.7%；大豆5632万吨，减少9.2%，进口均价为每吨2731.9元，下跌1.7%；初级形状的塑料2399万吨，增加11.1%，进口均价为每吨1万元，下跌11%；成品油2049万吨，减少6.3%，进口均价为每吨3790.4元，下跌0.6%；钢材764万吨，减少12.8%，进口均价为每吨8172.8元，上涨0.6%；未锻轧铜及铜材309万吨，减少10.8%，进口均价为每吨4.54万元，下跌3.5%。&lt;/p&gt;&lt;p&gt;此外，机电产品进口3.96万亿元，下降3.1%。其中，集成电路2719.4亿个，减少3.8%，价值1.31万亿元，下降0.8%；汽车70万辆，减少10.8%，价值2180.6亿元，下降4.6%。&lt;/p&gt;', '1', '1567945760', '小黄鸡', '3');

-- ----------------------------
-- Table structure for cates
-- ----------------------------
DROP TABLE IF EXISTS `cates`;
CREATE TABLE `cates` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '分类id',
  `cate_name` varchar(30) NOT NULL COMMENT '分类名字',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of cates
-- ----------------------------
INSERT INTO `cates` VALUES ('1', 'linux');
INSERT INTO `cates` VALUES ('2', 'bootstrap');
INSERT INTO `cates` VALUES ('3', 'PHP');
INSERT INTO `cates` VALUES ('4', 'Linux');
INSERT INTO `cates` VALUES ('5', 'C++');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '用户id',
  `username` varchar(30) NOT NULL COMMENT '用户账号',
  `name` varchar(30) NOT NULL DEFAULT '' COMMENT '用户网名',
  `password` varchar(32) NOT NULL COMMENT '用户密码',
  `email` varchar(60) NOT NULL COMMENT '用户电子邮箱',
  `profile` varchar(255) NOT NULL COMMENT '用户简介',
  `sex` tinyint(1) NOT NULL DEFAULT '0' COMMENT '用户性别1女0男-1保密',
  `logo` varchar(255) NOT NULL COMMENT '用户头像',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'admin', '小黄鸡', 'e10adc3949ba59abbe56e057f20f883e', '614580148@qq.com', '一个脱离谷歌就不会写代码的程序猿。', '0', '../upload/images/20190908 12020120190719 050913logo.jpg');
